[{"title":"Hello World","date":"2019-11-21T01:04:24.750Z","path":"2019/11/21/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"开博大吉","date":"2017-02-21T01:25:57.000Z","path":"2017/02/21/start/","text":"本博开博文章，以祭奠流逝的时间 今天是个好日子，在经历了无数的挫折之后，我终于也是拥有了一个自己的博客网站。 仿佛每个人都要写一下开博文章，我也就写一下吧，一方面是为了记录我搭建博客的心酸，另一方面也回忆一下过去，展望一下未来。 怎么萌生一个搭建个人博客的念头的呢？这个没有确切的起点，起初我的笔记，工作经验什么的都写在了印象笔记里面，也就是记录一下生活，工作的问题，但大多只是记录，没有太多的思考。而管理个人博客就要花更多的时间去管理、维护，更多的这是属于自己的小空间。同时，我看到网站上的博客越来越多，而且也很方便，可以和更多的技术大牛沟通，交流技术。这样看来，搭建个人博客还是很有必要的（我是这样说服自己的）。 搭建之路很漫长，本来可以一两天搞定的事情，我花了一个多星期。原因，主要是我的环境坏掉了。好像hexo都有一个弊端吧，就是init只能一个，再多就会报错。不可修复的那种，最重要的是不要把第一次init的文件删了。我就是死在的这一步。当时请教了一些人，没有解决，还衍生出了其他的错误。环境坏了能怎么办，心灰意冷只能换电脑。不过好在成功搭建，于是才有了它。这还是一个看脸的时代，好的皮肤可能比操作还要重要，所以，又花费时间找了个还不错的主题。这里问题就不再详述了。总之，它就这样走进我的生活当中。过程很残忍，却被成功的喜悦覆盖了。 现在看来，搭建博客很简单吗，，，对。不过，有句话说，坚持难，例子，就是苏格拉底的例子。要持续更新博客，这可是个技术活。思考，这是必不可少的，同时，博客可能不止自己看，所，应该让大多数的人看懂，这很重要。多长时间更一篇，这个，还没想好，不过，要有时间，但也不能拖更，要坚持，坚持就是胜利。 这里引进胡伟煌的一段话：“花费了这么多时间和精力，对我个人来说是否有什么影响，应该是说找到了一种比较笨的学习方式。写博客是很耗时间的，需要将你学习到的东西通过自己认为比较简练的语言归纳整理，并且有条理或系统地去让别人更容易读懂，在这过程中自己的总结归纳能力等可以得到锻炼，而有的知识你以为懂了，当要写出来的时候会发现好像还没懂，这时候也可以再去思考这个知识。当形成了自己的知识体系后，即时你哪天忘记了你写的内容，也可以很快的找到答案所在的地方。就好比开卷考试，当你记不住答案或者也不一定要记住答案是什么，只需要知道在哪里可以快速找到答案就够了。如果可以快速有效地解决问题，也不一定要关心你是怎么解决的。当你学的东西越来越多，你会发现你不懂的也越来越多，好比一个圆，圆内的面积越大，圆外接触的不懂的东西也越多。” 第一：生活 搭建博客的初衷，是沉淀一些自己知识、技能的记录。我对技术非常好奇，不断去尝试，各种摸索、各种分析。生活不仅仅只是上班下班，在上班的过程里面，还有那么一些尝试，让我尝试完，积累知识，然后好好沉淀下。 我一直都是一个很懂得“接受”的人，为什么说是接受呢？因为我觉得，我在生活中经历过的大大小小的各种事情，都是对自己的考验，按照市面上的一句话来说，就是感恩苦难。当然苦难本身是不值得感恩的，胡歌在采访中说，苦难本身是不值得感恩的，苦难带来的伤痛是无法抹去的。我真正要感谢的是自己在经历了各种事情之后所积累的经验与能力。所以说，我在碰到困难的时候第一想的不是放弃，而是尝试解决，就比如我在编程过程中，解决问题的最好方法是解决问题本身，而不是换条路达到解决问题的目的。当然，二者兼得更好。 或者现实一点的说法就是，我在不断增强自己的实力。活到老，学到老。我希望我的一生能够贯彻这一点。 第二：未来 毕业有一段时间了，工作暂时找好了，工作失误免不了被老板骂，一直没有离职。一方面，确实是自己做错了，无可厚非，错了就是错了，我也在积累项目错误的经验，为了以后再次碰到这种情况能快速解决。一方面，我觉得没必要记恨别人，人的一生也不过是白驹过隙，能让人生更有意义一些才会在闭上眼睛回望一生时嘴角上扬。而且，老板也不坏，人之初，性本善，当然也可能是我还没碰到所以才说出这样的话。这里，我要感谢我老板在我工作方面的照顾，批评我的错误是正常的，体谅员工的老板才是好老板，巧的是，我的老板就是这样的人。 对未来的规划，小时候，在电视上看职场情景，有赶地铁的人，拿着早餐路上吃的上班族，早上赶电梯，晚上外套一脱，躺床上。好像生活很单一，又很无聊。如今看来，似乎生活还有很多乐趣。工作也不是如僵尸一样低头看文档。现在，首先是挣钱吧，最主要的是养活自己，不至于看到有人帮助的时候一掏腰包两手空，然后努力工作，给父母更好的生活，闲暇时间还可以旅旅游，放松一下。然后感叹，这就是生活鸭。 未来可期！ 第三：时间 时间是个好东西，只喜多不喜少。 就比如，这篇博客吧，本来打算二十分钟写完的，结果，边想边写，就花费了四十多分钟。 最近遇到一些事情，逼迫自己去思考工作、生活的意义。才发现工作是忙了，但是得到的除了钱，好像什么都没有。 精神还是空虚着，能力还是没怎么提高，未来10年、20年，靠什么继续下去？ 开一个博客，对人生的一种坚持与新生，在未来，尝试不一样的事情，对生活，充满着期待！","tags":[{"name":"生活","slug":"生活","permalink":"http://yoursite.com/tags/%E7%94%9F%E6%B4%BB/"},{"name":"start","slug":"start","permalink":"http://yoursite.com/tags/start/"}]}]